iBGP1#sh ipv6  int bri
GigabitEthernet1       [up/up]
    unassigned
GigabitEthernet2       [up/up]
    FE80::250:56FF:FE97:9351
    2024:192:168:2::1
Loopback1              [up/up]
    FE80::21E:49FF:FE22:4400
    2024:192:168:3::1
iBGP1#show run
!
hostname iBGP1
!
!
no aaa new-model
!
no ip domain lookup
ip domain name dcloud.cisco.com
!
ipv6 unicast-routing
!
!
username admin privilege 15 secret 9 $9$O/qFBNaJ/YZb3.$PwXJCAOmTq4cqfYlhvUd8pg.Wh1ZlWzRwLRXNs.xHSk
!
!
interface Loopback1
 no ip address
 ipv6 address 2024:192:168:3::1/128
 ipv6 ospf 1 area 1
!
interface GigabitEthernet1
 ip dhcp client client-id GigabitEthernet1
 ip address dhcp
 negotiation auto
!
interface GigabitEthernet2
 no ip address
 negotiation auto
 ipv6 address 2024:192:168:2::1/80
 ipv6 ospf 1 area 0
!
router ospfv3 1
 router-id 192.168.2.1
 !
 address-family ipv6 unicast
 exit-address-family
!
router bgp 6939
 bgp router-id 192.168.2.1
 bgp log-neighbor-changes
 neighbor 2024:192:168:2::7 remote-as 6939
 neighbor 2024:192:168:2::8 remote-as 6939
 neighbor 2024:192:168:2::9 remote-as 6939
 neighbor 2024:192:168:2::10 remote-as 6939
 !
 address-family ipv4
  no neighbor 2024:192:168:2::7 activate
  no neighbor 2024:192:168:2::8 activate
  no neighbor 2024:192:168:2::9 activate
  no neighbor 2024:192:168:2::10 activate
 exit-address-family
 !
 address-family ipv6
  neighbor 2024:192:168:2::7 activate
  neighbor 2024:192:168:2::7 route-reflector-client
  neighbor 2024:192:168:2::8 activate
  neighbor 2024:192:168:2::8 route-reflector-client
  neighbor 2024:192:168:2::9 activate
  neighbor 2024:192:168:2::9 route-reflector-client
  neighbor 2024:192:168:2::10 activate
  neighbor 2024:192:168:2::10 route-reflector-client
 exit-address-family
!
!
line con 0
 stopbits 1
line aux 0
line vty 0 4
 timeout login response 300
 privilege level 15
 logging synchronous
 no login
 transport input all
!
!
end

iBGP1#sh ipv6 route
IPv6 Routing Table - default - 9 entries
Codes: C - Connected, L - Local, S - Static, U - Per-user Static route
       B - BGP, R - RIP, H - NHRP, HG - NHRP registered
       Hg - NHRP registration summary, HE - NHRP External, I1 - ISIS L1
       I2 - ISIS L2, IA - ISIS interarea, IS - ISIS summary, D - EIGRP
       EX - EIGRP external, ND - ND Default, NDp - ND Prefix, DCE - Destination
       NDr - Redirect, O - OSPF Intra, OI - OSPF Inter, OE1 - OSPF ext 1
       OE2 - OSPF ext 2, ON1 - OSPF NSSA ext 1, ON2 - OSPF NSSA ext 2
       a - Application, m - OMP
B   2024:11::11/128 [200/0], tag 11
     via 2024:192:168:1::11
B   2024:12::12/128 [200/0], tag 12
     via 2024:192:168:1::12
B   2024:13::13/128 [200/0], tag 13
     via 2024:192:168:1::13
O   2024:192:168:1::/80 [110/2]
     via FE80::250:56FF:FE97:9357, GigabitEthernet2
     via FE80::250:56FF:FE97:9359, GigabitEthernet2
     via FE80::250:56FF:FE97:9358, GigabitEthernet2
     via FE80::250:56FF:FE97:9360, GigabitEthernet2
C   2024:192:168:2::/80 [0/0]
     via GigabitEthernet2, directly connected
L   2024:192:168:2::1/128 [0/0]
     via GigabitEthernet2, receive
LC  2024:192:168:3::1/128 [0/0]
     via Loopback1, receive
OI  2024:192:168:3::2/128 [110/1]
     via FE80::250:56FF:FE97:6C52, GigabitEthernet2
L   FF00::/8 [0/0]
     via Null0, receive
iBGP1#sh bgp ipv6 unicast summary
BGP router identifier 192.168.2.1, local AS number 6939
BGP table version is 10, main routing table version 10
3 network entries using 816 bytes of memory
6 path entries using 960 bytes of memory
3/3 BGP path/bestpath attribute entries using 888 bytes of memory
3 BGP AS-PATH entries using 72 bytes of memory
0 BGP route-map cache entries using 0 bytes of memory
0 BGP filter-list cache entries using 0 bytes of memory
BGP using 2736 total bytes of memory
BGP activity 4/1 prefixes, 16/10 paths, scan interval 60 secs
3 networks peaked at 14:01:32 May 23 2024 UTC (17:29:46.495 ago)

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
2024:192:168:2::7
                4         6939    1142    1141       10    0    0 17:09:55        2
2024:192:168:2::8
                4         6939    1139    1146       10    0    0 17:09:50        2
2024:192:168:2::9
                4         6939    1139    1136       10    0    0 17:09:38        1
2024:192:168:2::10
                4         6939    1143    1143       10    0    0 17:09:33        1
iBGP1#sh bgp ipv6 unicast
BGP table version is 10, local router ID is 192.168.2.1
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal, 
              r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter, 
              x best-external, a additional-path, c RIB-compressed, 
              t secondary path, L long-lived-stale,
Origin codes: i - IGP, e - EGP, ? - incomplete
RPKI validation codes: V valid, I invalid, N Not found

     Network          Next Hop            Metric LocPrf Weight Path
 * i  2024:11::11/128  2024:192:168:1::11
                                                0    100      0 11 ?
 *>i                   2024:192:168:1::11
                                                0    100      0 11 ?
 * i  2024:12::12/128  2024:192:168:1::12
                                                0    100      0 12 ?
 *>i                   2024:192:168:1::12
                                                0    100      0 12 ?
 * i  2024:13::13/128  2024:192:168:1::13
                                                0    100      0 13 ?
 *>i                   2024:192:168:1::13
                                                0    100      0 13 ?
iBGP1#sh bgp ipv6 unicast nei 2024:192:168:2::7 adv
BGP table version is 10, local router ID is 192.168.2.1
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal, 
              r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter, 
              x best-external, a additional-path, c RIB-compressed, 
              t secondary path, L long-lived-stale,
Origin codes: i - IGP, e - EGP, ? - incomplete
RPKI validation codes: V valid, I invalid, N Not found

     Network          Next Hop            Metric LocPrf Weight Path
 *>i  2024:11::11/128  2024:192:168:1::11
                                                0    100      0 11 ?
 *>i  2024:12::12/128  2024:192:168:1::12
                                                0    100      0 12 ?
 *>i  2024:13::13/128  2024:192:168:1::13
                                                0    100      0 13 ?

Total number of prefixes 3 
iBGP1#sh bgp ipv6 unicast nei 2024:192:168:2::8 adv
BGP table version is 10, local router ID is 192.168.2.1
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal, 
              r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter, 
              x best-external, a additional-path, c RIB-compressed, 
              t secondary path, L long-lived-stale,
Origin codes: i - IGP, e - EGP, ? - incomplete
RPKI validation codes: V valid, I invalid, N Not found

     Network          Next Hop            Metric LocPrf Weight Path
 *>i  2024:11::11/128  2024:192:168:1::11
                                                0    100      0 11 ?
 *>i  2024:12::12/128  2024:192:168:1::12
                                                0    100      0 12 ?
 *>i  2024:13::13/128  2024:192:168:1::13
                                                0    100      0 13 ?

Total number of prefixes 3 
iBGP1#sh bgp ipv6 unicast nei 2024:192:168:2::9 adv
BGP table version is 10, local router ID is 192.168.2.1
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal, 
              r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter, 
              x best-external, a additional-path, c RIB-compressed, 
              t secondary path, L long-lived-stale,
Origin codes: i - IGP, e - EGP, ? - incomplete
RPKI validation codes: V valid, I invalid, N Not found

     Network          Next Hop            Metric LocPrf Weight Path
 *>i  2024:11::11/128  2024:192:168:1::11
                                                0    100      0 11 ?
 *>i  2024:12::12/128  2024:192:168:1::12
                                                0    100      0 12 ?
 *>i  2024:13::13/128  2024:192:168:1::13
                                                0    100      0 13 ?

Total number of prefixes 3 
iBGP1#sh bgp ipv6 unicast nei 2024:192:168:2::10 adv
BGP table version is 10, local router ID is 192.168.2.1
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal, 
              r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter, 
              x best-external, a additional-path, c RIB-compressed, 
              t secondary path, L long-lived-stale,
Origin codes: i - IGP, e - EGP, ? - incomplete
RPKI validation codes: V valid, I invalid, N Not found

     Network          Next Hop            Metric LocPrf Weight Path
 *>i  2024:11::11/128  2024:192:168:1::11
                                                0    100      0 11 ?
 *>i  2024:12::12/128  2024:192:168:1::12
                                                0    100      0 12 ?
 *>i  2024:13::13/128  2024:192:168:1::13
                                                0    100      0 13 ?

Total number of prefixes 3 
iBGP1#sh ipv6 ospf int bri
Interface    PID   Area            Intf ID    Cost  State Nbrs F/C
Gi2          1     0               6          1     BDR   5/5
Lo1          1     1               8          1     LOOP  0/0
iBGP1#sh ipv6 ospf  nei

            OSPFv3 Router with ID (192.168.2.1) (Process ID 1)

Neighbor ID     Pri   State           Dead Time   Interface ID    Interface
192.168.1.7       0   FULL/DROTHER    00:00:31    7               GigabitEthernet2
192.168.1.8       0   FULL/DROTHER    00:00:39    7               GigabitEthernet2
192.168.1.9       0   FULL/DROTHER    00:00:39    7               GigabitEthernet2
192.168.1.10      0   FULL/DROTHER    00:00:35    7               GigabitEthernet2
192.168.2.2       1   FULL/DR         00:00:32    6               GigabitEthernet2
iBGP1#
