RS10#sh ipv6  int bri
GigabitEthernet1       [up/up]
    unassigned
GigabitEthernet2       [up/up]
    FE80::250:56FF:FE97:6C60
    2024:192:168:1::10
GigabitEthernet3       [up/up]
    FE80::250:56FF:FE97:9360
    2024:192:168:2::10
RS10#show run
!
hostname RS10
!
no ip domain-lookup
!
ip domain name dcloud.cisco.com
!
ipv6 unicast-routing
!
!
!
interface GigabitEthernet1
 ip dhcp client client-id GigabitEthernet1
 ip address dhcp
 negotiation auto
!
interface GigabitEthernet2
 no ip address
 negotiation auto
 ipv6 address 2024:192:168:1::10/80
 ipv6 ospf 1 area 0
!
interface GigabitEthernet3
 no ip address
 negotiation auto
 ipv6 address 2024:192:168:2::10/80
 ipv6 ospf 1 area 0
 ipv6 ospf priority 0
!
router ospfv3 1
 router-id 192.168.1.10
 !
 address-family ipv6 unicast
 exit-address-family
!
router bgp 6939
 bgp router-id 192.168.1.10
 bgp log-neighbor-changes
 neighbor 2024:192:168:1::13 remote-as 13
 neighbor 2024:192:168:2::1 remote-as 6939
 neighbor 2024:192:168:2::2 remote-as 6939
 !
 address-family ipv4
  no neighbor 2024:192:168:1::13 activate
  no neighbor 2024:192:168:2::1 activate
  no neighbor 2024:192:168:2::2 activate
 exit-address-family
 !
 address-family ipv6
  neighbor 2024:192:168:1::13 activate
  neighbor 2024:192:168:1::13 route-reflector-client
  neighbor 2024:192:168:2::1 activate
  neighbor 2024:192:168:2::2 activate
 exit-address-family
!
!
line con 0
 stopbits 1
line aux 0
line vty 0 4
 timeout login response 300
 privilege level 15
 logging synchronous
 no login
 transport input all
!
end

RS10#sh ipv6 route
IPv6 Routing Table - default - 10 entries
Codes: C - Connected, L - Local, S - Static, U - Per-user Static route
       B - BGP, R - RIP, H - NHRP, HG - NHRP registered
       Hg - NHRP registration summary, HE - NHRP External, I1 - ISIS L1
       I2 - ISIS L2, IA - ISIS interarea, IS - ISIS summary, D - EIGRP
       EX - EIGRP external, ND - ND Default, NDp - ND Prefix, DCE - Destination
       NDr - Redirect, O - OSPF Intra, OI - OSPF Inter, OE1 - OSPF ext 1
       OE2 - OSPF ext 2, ON1 - OSPF NSSA ext 1, ON2 - OSPF NSSA ext 2
       a - Application, m - OMP
B   2024:11::11/128 [200/0], tag 11
     via 2024:192:168:1::11
B   2024:12::12/128 [200/0], tag 12
     via 2024:192:168:1::12
B   2024:13::13/128 [20/0], tag 13
     via FE80::250:56FF:FE97:6C43, GigabitEthernet2
C   2024:192:168:1::/80 [0/0]
     via GigabitEthernet2, directly connected
L   2024:192:168:1::10/128 [0/0]
     via GigabitEthernet2, receive
C   2024:192:168:2::/80 [0/0]
     via GigabitEthernet3, directly connected
L   2024:192:168:2::10/128 [0/0]
     via GigabitEthernet3, receive
OI  2024:192:168:3::1/128 [110/1]
     via FE80::250:56FF:FE97:9351, GigabitEthernet3
OI  2024:192:168:3::2/128 [110/1]
     via FE80::250:56FF:FE97:6C52, GigabitEthernet3
L   FF00::/8 [0/0]
     via Null0, receive
RS10#sh bgp ipv6 unicast summary
BGP router identifier 192.168.1.10, local AS number 6939
BGP table version is 10, main routing table version 10
3 network entries using 816 bytes of memory
7 path entries using 1120 bytes of memory
4/3 BGP path/bestpath attribute entries using 1184 bytes of memory
4 BGP rrinfo entries using 160 bytes of memory
3 BGP AS-PATH entries using 72 bytes of memory
0 BGP route-map cache entries using 0 bytes of memory
0 BGP filter-list cache entries using 0 bytes of memory
BGP using 3352 total bytes of memory
BGP activity 4/1 prefixes, 14/7 paths, scan interval 60 secs
3 networks peaked at 14:27:46 May 23 2024 UTC (17:00:41.761 ago)

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
2024:192:168:1::13
                4           13    1175    1175       10    0    0 17:45:22        1
2024:192:168:2::1
                4         6939    1139    1140       10    0    0 17:06:42        3
2024:192:168:2::2
                4         6939    1137    1136       10    0    0 17:06:05        3
RS10#sh bgp ipv6 unicast
BGP table version is 10, local router ID is 192.168.1.10
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal, 
              r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter, 
              x best-external, a additional-path, c RIB-compressed, 
              t secondary path, L long-lived-stale,
Origin codes: i - IGP, e - EGP, ? - incomplete
RPKI validation codes: V valid, I invalid, N Not found

     Network          Next Hop            Metric LocPrf Weight Path
 * i  2024:11::11/128  2024:192:168:1::11
                                                0    100      0 11 ?
 *>i                   2024:192:168:1::11
                                                0    100      0 11 ?
 * i  2024:12::12/128  2024:192:168:1::12
                                                0    100      0 12 ?
 *>i                   2024:192:168:1::12
                                                0    100      0 12 ?
 * i  2024:13::13/128  2024:192:168:1::13
                                                0    100      0 13 ?
 * i                   2024:192:168:1::13
                                                0    100      0 13 ?
 *>                    2024:192:168:1::13
                                                0             0 13 ?
RS10#sh bgp ipv6 unicast nei 2024:192:168:1::13 adv
BGP table version is 10, local router ID is 192.168.1.10
Status codes: s suppressed, d damped, h history, * valid, > best, i - internal, 
              r RIB-failure, S Stale, m multipath, b backup-path, f RT-Filter, 
              x best-external, a additional-path, c RIB-compressed, 
              t secondary path, L long-lived-stale,
Origin codes: i - IGP, e - EGP, ? - incomplete
RPKI validation codes: V valid, I invalid, N Not found

     Network          Next Hop            Metric LocPrf Weight Path
 *>i  2024:11::11/128  2024:192:168:1::11
                                                0    100      0 11 ?
 *>i  2024:12::12/128  2024:192:168:1::12
                                                0    100      0 12 ?

Total number of prefixes 2 
RS10#sh ipv6 ospf int bri
Interface    PID   Area            Intf ID    Cost  State Nbrs F/C
Gi3          1     0               7          1     DROTH 2/5
Gi2          1     0               6          1     DR    0/0
RS10#sh ipv6 ospf  nei

            OSPFv3 Router with ID (192.168.1.10) (Process ID 1)

Neighbor ID     Pri   State           Dead Time   Interface ID    Interface
192.168.1.7       0   2WAY/DROTHER    00:00:35    7               GigabitEthernet3
192.168.1.8       0   2WAY/DROTHER    00:00:30    7               GigabitEthernet3
192.168.1.9       0   2WAY/DROTHER    00:00:35    7               GigabitEthernet3
192.168.2.1       1   FULL/BDR        00:00:39    6               GigabitEthernet3
192.168.2.2       1   FULL/DR         00:00:39    6               GigabitEthernet3
RS10#
